
institutioncodes={'fddx': ['4131010246', '复旦大学'],
 'tjdx': ['4131010247', '同济大学'],
 'hdlgdx': ['4131010251', '华东理工大学'],
 'dhdx': ['4131010255', '东华大学'],
 'shdx': ['4131010280', '上海大学'],
 'shhydx': ['4131010264', '上海海洋大学'],
 'shhsdx': ['4131010254', '上海海事大学']}


enterprisecodes={'shydkxyqgfyxgs': ['da23b53c0de14e32b6b9b41baf57a8b5', '上海仪电科学仪器股份有限公司'],
 'shswxpyxgs': ['20210413618297409390', '上海生物芯片有限公司'],
 'shdqjtgfyxgs': ['20210413618297409380', '上海电气集团股份有限公司'],
 # 'shydjtyxgszyyjy': ['20210413618297409370', '上海仪电(集团)有限公司中央研究院'],
 'shmdxswyygfyxgs': ['925f1d6b18664d8c9810e417cc4cea36', '上海美迪西生物医药股份有限公司'],
 'shhygxjsfzyjyyxgs': ['20210413618297409360', '上海航翼高新技术发展研究院有限公司']}

governmentcodes={'sh': ['202003051583349087390', '上海'],
 'sc': ['202003051583352867571', '四川'],
 'bj': ['202003051583352865970', '北京'],
 'zj': ['202003051583352873443', '浙江'],
 'js': ['202003051583352871817', '江苏'],
 'ah': ['202003051583352868938', '安徽'],
 'hb': ['202003051583352874661', '湖北'],
 'hn': ['202003051583352873048', '河南'],
 'gz': ['202003051583354615799', '广州'],
 'sz': ['202003051583354686782', '深圳']
                 }

